app/controllers/results_controller.rb

SELECT "results".* FROM "results"
---
  def index
    @results = Result.all

SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def download
      @result = Result.find(params[:id])

INSERT INTO "results" ("file_file_name", "file_content_type", "file_file_size", "file_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @result = Result.new hola
    if @result.save